{
  "spidermans": [
    {
      "id": "tobey01",
      "logo": "/assets/images/spiderman-tobey/movie-01/logo.png ",
      "year": "2002",
      "director":"Sam Remi",
      "synopsis": "Depois de ser picado por uma aranha geneticamente modificada em uma demonstração científica, o jovem nerd Peter Parker ganha superpoderes. Inicialmente, ele pretende usá-los para para ganhar dinheiro, adotando o nome de Homem-Aranha e se apresentando em lutas de exibição. Porém, ao presenciar o assassinando de seu tio Ben e sentir-se culpado, Peter decide não mais usar seus poderes para proveito próprio e sim para enfrentar o mal, tendo como seu primeiro grande desafio o psicótico Duende Verde",
      "trailer": "https://www.youtube.com/watch?v=TYMMOjBUPMM",
      "pictures": [
        "/assets/images/spiderman-tobey/movie-01/gallery/image-01.png",
        "/assets/images/spiderman-tobey/movie-01/gallery/image-02.png",
        "/assets/images/spiderman-tobey/movie-01/gallery/image-03.png"
      ],
      "background":"/assets/images/spiderman-tobey/movie-01/background.png"
    },
 
    {
      "id": "andrew01",
      "logo": "/assets/images/spiderman-andrew/movie-01/logo.png ",
      "year": "2012",
      "director":"Marc Webb",
      "synopsis": "Abandonado por seus pais quando criança, Peter Parker foi criado por seu tio Ben e tia May. Ele agora está no ensino médio, mas está lutando para se integrar. Como a maioria dos adolescentes de sua idade, Peter está tentando descobrir quem ele é e aceitar sua jornada. Amantes pela primeira vez, ele e Gwen Stacy descobrem sentimentos, compromissos e segredos. Ao encontrar uma pasta misteriosa que pertenceu a seu pai, Peter inicia uma busca para elucidar o desaparecimento de seus pais, que rapidamente o leva à Oscorp e ao laboratório do Dr. Curt Connors, ex-parceiro de seu pai. O Homem-Aranha logo se encontrará cara a cara com o Lagarto, o alter ego de Connors. Ao decidir usar seus poderes, ele escolherá seu destino...",
      "trailer": "https://www.youtube.com/watch?v=6nzNdpJ3qMo",
      "pictures": [
        "/assets/images/spiderman-andrew/movie-01/gallery/image-01.png",
        "/assets/images/spiderman-andrew/movie-01/gallery/image-02.png",
        "/assets/images/spiderman-andrew/movie-01/gallery/image-03.png"
      ],
      "background":"/assets/images/spiderman-andrew/movie-01/background.png"
    },

    {
      "id": "tom01",
      "logo": "/assets/images/spiderman-tom/movie-01/logo.png ",
      "year": "2017",
      "director":"Jon Watts",
      "synopsis": "Após sua estreia espetacular em Capitão América: Guerra Civil, o jovem Peter Parker gradualmente descobre sua nova identidade, a do Homem-Aranha, o super-herói lançador de teias. Animado por sua experiência com os Vingadores, Peter volta para casa, para sua tia May, sob o olhar atento de seu novo mentor, Tony Stark. Ele luta para voltar à sua antiga vida, mas, no fundo, Peter sonha em provar a si mesmo que é mais do que apenas o super-herói amigo da vizinhança. O aparecimento de um novo inimigo, o Abutre, colocará em perigo tudo o que é importante para ele...",
      "trailer": "https://www.youtube.com/watch?v=rk-dF1lIbIg",
      "pictures": [
        "/assets/images/spiderman-tom/movie-01/gallery/image-01.png",
        "/assets/images/spiderman-tom/movie-01/gallery/image-02.png",
        "/assets/images/spiderman-tom/movie-01/gallery/image-03.png",
        "/assets/images/spiderman-tom/movie-01/gallery/image-04.png"
      ],
      "background":"/assets/images/spiderman-tom/movie-01/background.png"
    }
  ]
}